[
  {
    "id": "home",
    "name": "Home",
    "country": "",
    "class": "",
    "size": "",
    "description": "Welcome to a tribute to the tanks that shaped World War II! This site features a handpicked assortment of tanks, each one playing a significant role in the course of the war. From the heavily armored behemoths to the fast, agile scout vehicles, these tanks represent the evolution of military technology under extreme conditions. With detailed descriptions, images, and 3D models, explore the legacy of these machines and their lasting impact on history, strategy, and warfare. This is a place to learn, appreciate, and be amazed by the armored giants of the past.",
    "image_1": "img/home.gif",
    "image_2": "img/home.gif",
    "image_3": "img/home.gif",
    "glb": "3d/Tiger_1.glb",
    "flag": "img/un.svg"
  },
  {
    "id": "StuG_III_G",
    "name": "StuG III G",
    "country": "Germany",
    "class": "Assault Gun",
    "size": "Medium",
    "description": "The Sturmgeschütz III Ausführung G (StuG III G) was the final and most produced variant of Germany's highly successful assault gun series during World War II. Introduced in late 1942, the StuG III G mounted a powerful 75mm StuK 40 L/48 gun on a low-profile chassis derived from the Panzer III, offering excellent firepower and protection at a relatively low cost. By eliminating the rotating turret, the StuG III could be mass-produced efficiently and was especially effective in defensive roles, ambushing enemy armor and supporting infantry with high-explosive shells. <br><br> Over 8,000 StuG III G units were built, making it one of the most important armored vehicles in the Wehrmacht's arsenal. It featured a cast gun mantlet nicknamed the 'Saukopf' (pig's head) for its rounded shape, and later models included a remote-controlled MG 34 for close defense. Though not a traditional tank, its impact on the battlefield was immense, and it became one of the highest-scoring tank destroyers of the war. The StuG III G's simplicity, reliability, and versatility made it a favorite among German crews and a formidable opponent to Allied armor.",
    "image_1": "img/StuG_III_G.jpg",
    "image_2": "img/StuG_III_G_2.jpg",
    "image_3": "img/StuG_III_G_3.jpg",
    "glb": "3d/Stug_III_G.glb",
    "flag": "img/de.svg"
  },
  {
    "id": "Tiger_I",
    "name": "Tiger I",
    "country": "Germany",
    "class": "Heavy Tank",
    "size": "Large",
    "description": "The Panzerkampfwagen VI Tiger I was one of Nazi Germany's most iconic heavy tanks, introduced in 1942 as a response to formidable Soviet armor like the T-34 and KV-1. Armed with the powerful 88mm KwK 36 L/56 gun, the Tiger I could destroy most Allied tanks at long range, often before they could return fire. Its thick armor, sometimes over 100mm on the front, made it nearly impervious to many enemy weapons of the time, earning it a fearsome reputation on both the Eastern and Western fronts. <br><br> However, the Tiger I's advantages came at the cost of complexity and reliability. It was mechanically prone to breakdowns and difficult to transport due to its heavy weight. Despite these drawbacks, it performed exceptionally well in the hands of skilled crews, with tank aces like Michael Wittmann achieving legendary status. Only about 1,350 were produced, but their psychological and battlefield impact far exceeded their numbers, symbolizing the might and engineering ambition of German armored forces during World War II.",
    "image_1": "img/Tiger_I.jpg",
    "image_2": "img/Tiger_I_2.gif",
    "image_3": "img/Tiger_I_3.jpg",
    "glb": "3d/Tiger_1.glb",
    "flag": "img/de.svg"
  },
  {
    "id": "Sd_Kfz_234_2_Puma",
    "name": "Sd. Kfz. 234/2",
    "country": "Germany",
    "class": "Armored Car",
    "size": "Medium",
    "description": "The Sd.Kfz. 234/2, better known as the 'Puma' was a German eight-wheeled armored car developed for reconnaissance roles during World War II. It featured a fully enclosed turret mounting a 50mm KwK 39/1 L/60 gun—the same weapon used on some Panzer III variants—giving it impressive firepower for a scout vehicle. Its sleek design, sloped armor, and high mobility made it one of the most advanced armored cars of the war. The 234/2 was powered by a Tatra V12 diesel engine and could reach speeds of up to 85 km/h, both forward and in reverse thanks to dual driving positions.<br><br> Despite being intended for reconnaissance, the Puma was capable of holding its own against light and even medium enemy vehicles, though its armor was relatively thin. Only around 100 were built before production shifted to other Sd.Kfz. 234 variants with heavier armament but no turret. The Puma remains one of the most celebrated armored cars of the war, admired for its balance of speed, firepower, and cutting-edge design—traits that influenced post-war armored vehicle development across NATO forces.",
    "image_1": "img/Sd_Kfz_234_2_Puma.jpg",
    "image_2": "img/Sd_Kfz_234_2_Puma_2.jpg",
    "image_3": "img/Sd_Kfz_234_2_Puma_3.jpg",
    "glb": "3d/puma.glb",
    "flag": "img/de.svg"
  },
  {
    "id": "M22",
    "name": "M22",
    "country": "United States",
    "class": "Light Tank",
    "size": "Small",
    "description": "The M22 Locust was a light airborne tank developed by the United States during World War II, designed specifically to be air-dropped or transported by glider for use by airborne troops. Weighing just under 8 tons, it was compact and light enough to fit inside a British Hamilcar glider, but still featured a 37mm M6 main gun and armor thick enough to protect against small arms fire. The M22 was powered by a 165 hp Lycoming engine, giving it a top speed of around 40 km/h on roads—ideal for quick hit-and-run tactics once deployed behind enemy lines.<br><br>Although innovative in concept, the M22 saw very limited combat use, with its most notable deployment being during Operation Varsity in March 1945. Unfortunately, the tank's thin armor and underpowered gun made it vulnerable even to light anti-tank weapons, and mechanical reliability issues further limited its effectiveness. Despite these shortcomings, the M22 represented an important step in airborne armor doctrine and experimentation, influencing future designs in rapid-deployment armored vehicles used during the Cold War.",
    "image_1": "img/M22.gif",
    "image_2": "img/M22_2.jpg",
    "image_3": "img/M22_3.jpg",
    "glb": "3d/M22.glb",
    "flag": "img/us.jpg"
  },
  {
    "id": "M4A2",
    "name": "M4A2",
    "country": "United States",
    "class": "Medium Tank",
    "size": "Medium",
    "description": "The M4A2 was a diesel-powered variant of the iconic M4 Sherman medium tank, widely used by Allied forces during World War II. Unlike other versions that used gasoline engines, the M4A2 was equipped with a General Motors 6046 twin diesel engine, making it more suitable for lend-lease use, especially with the Soviet Union and British Commonwealth forces, who preferred diesel for its lower flammability. It retained the 75mm M3 gun in early models and was later upgraded with a 76mm gun in some versions to better deal with improved German armor.<br><br>The M4A2 was known for its reliability, ease of maintenance, and adaptability on the battlefield. Over 8,000 units were produced, many of which served in harsh environments on the Eastern Front, where Soviet crews praised the Sherman for its relatively comfortable crew conditions, decent mobility, and dependable performance. While its armor and firepower were eventually outclassed by late-war German tanks, the M4A2 remained an effective workhorse and symbol of Allied industrial strength and cooperation, serving well into the post-war years with various nations.",
    "image_1": "img/M4A2.jpg",
    "image_2": "img/M4A2_2.jpg",
    "image_3": "img/M4A2_3.jpg",
    "glb": "3d/M4A2.glb",
    "flag": "img/us.jpg"
  },
  {
    "id": "M3",
    "name": "M3",
    "country": "United States",
    "class": "Light Tank",
    "size": "Small",
    "description": "The M3 Lee was an American medium tank developed early in World War II, notable for its unusual dual-gun layout. It mounted a 75mm M2 or M3 gun in a right-side sponson and a 37mm gun in a fully rotating turret on top, giving it a distinctive and somewhat awkward profile. The design was a stopgap measure while the more modern M4 Sherman was being developed, but it allowed the U.S. to field a medium tank with a powerful main gun capable of taking on Axis armor. The Lee was named after Confederate General Robert E. Lee, while its British variant was called the 'Grant.'<br><br>Though it saw limited use by American forces after 1943, the M3 Lee played a key role in the North African Campaign, where its 75mm gun proved effective against German and Italian tanks. However, its tall silhouette, limited traverse of the main gun, and complex layout were major drawbacks. The tank was also sent to the Soviet Union through Lend-Lease, where it was appreciated early on but quickly phased out in favor of better designs. Despite its flaws, the M3 Lee helped bridge the gap in U.S. tank development and provided valuable combat experience that influenced later American armored vehicles.",
    "image_1": "img/M3.jpg",
    "image_2": "img/M3_2.jpg",
    "image_3": "img/M3_3.jpg",
    "glb": "3d/M3.glb",
    "flag": "img/us.jpg"
  },
  {
    "id": "KV-2",
    "name": "KV-2",
    "country": "Soviet Union",
    "class": "Heavy Tank",
    "size": "Large",
    "description": "The KV-2 was a Soviet heavy assault tank developed in the early stages of World War II, known for its massive, boxy turret and formidable 152mm M-10 howitzer. Built on the KV-1 chassis, the KV-2 was designed to destroy fortified positions and bunkers with high-explosive shells, making it a powerful tool during the Winter War against Finland and the early German invasion. Its armor was exceptionally thick for the time, making it nearly impervious to most German anti-tank weapons during the initial stages of Operation Barbarossa.<br><br>However, the KV-2's enormous turret made it slow and top-heavy, and the heavy gun was difficult to reload and traverse, especially on uneven terrain. Mechanical breakdowns and logistical challenges were common, limiting its operational effectiveness. Despite its shortcomings, the KV-2 caused chaos among early German units unprepared to deal with its armor, buying valuable time for the Red Army. Though it was quickly phased out in favor of more practical designs, the KV-2 remains an enduring symbol of Soviet brute-force tank engineering.",
    "image_1": "img/KV-2.jpg",
    "image_2": "img/KV-2_2.jpg",
    "image_3": "img/KV-2_3.jpg",
    "glb": "3d/KV2.glb",
    "flag": "img/su.svg"
  },
  {
    "id": "T-34",
    "name": "T-34",
    "country": "Soviet Union",
    "class": "Medium Tank",
    "size": "Medium",
    "description": "The T-34 was the Soviet Union's most influential and widely produced tank of World War II, often hailed as one of the most effective and revolutionary armored vehicles of the 20th century. Introduced in 1940, the T-34 combined a powerful 76.2mm gun (later upgraded to 85mm in the T-34/85), sloped armor for increased protection, and wide tracks suited for rough terrain and mud. These features gave it a crucial edge over early German tanks during the invasion of the USSR, forcing a rapid shift in German armored development.<br><br>With over 80,000 units produced during the war, the T-34 became the backbone of the Red Army's armored forces. Its design emphasized simplicity and ease of mass production, allowing Soviet factories to churn out large numbers even under harsh wartime conditions. Though it lacked the crew comforts and communication equipment found in many Western tanks, its battlefield resilience and adaptability earned it legendary status. The T-34 was instrumental in turning the tide on the Eastern Front and remained in service with various nations well into the late 20th century.",
    "image_1": "img/T-34_42.gif",
    "image_2": "img/T-34_42_2.jpg",
    "image_3": "img/T-34_42_3.jpg",
    "glb": "3d/T-34.glb",
    "flag": "img/su.svg"
  },
  {
    "id": "SU-122",
    "name": "Su-122",
    "country": "Soviet Union",
    "class": "Self-Propelled Gun",
    "size": "Medium",
    "description": "The SU-122 was a Soviet self-propelled gun used during World War II, based on the T-34 chassis. Its main armament was a 122mm howitzer, the same gun used on the SU-76, but with more firepower, making it effective against infantry, fortifications, and even enemy tanks at close range. The SU-122 was primarily used in the role of artillery support for infantry, providing direct fire to break through enemy defenses. Its mobility, derived from the T-34 chassis, allowed it to keep up with fast-moving tank units, offering a flexible and potent support weapon on the battlefield.<br><br>Despite its effectiveness, the SU-122 had limitations. Its armor was relatively thin, making it vulnerable to German anti-tank guns, and it lacked a turret, limiting its ability to engage targets on the move. Still, it was widely used during major Soviet offensives, including the Battle of Kursk and the liberation of Eastern Europe. Around 1,200 units were produced, and while it was eventually overshadowed by more powerful and versatile vehicles like the SU-85 and SU-100, the SU-122 served as an important stepping stone in the development of Soviet self-propelled artillery.",
    "image_1": "img/Su-122.jpg",
    "image_2": "img/Su-122_2.jpg",
    "image_3": "img/Su-122_3.jpg",
    "glb": "3d/Su-122.glb",
    "flag": "img/su.svg"
  },
  {
    "id": "Panzer_IV_H",
    "name": "Panzer IV H",
    "country": "Germany",
    "class": "Medium Tank",
    "size": "Medium",
    "description": "The Panzerkampfwagen IV Ausführung H (Panzer IV H) (Sd.Kfz. 161/2) was the eighth variant of the Panzer IV medium tank family and represented a significant evolution in German tank design. Introduced in 1943, it was essentially an improved version of the Panzer IV G, with modifications focused on simplifying manufacturing and enhancing battlefield survivability. The most notable upgrade was the addition of 5mm side skirt armor plates (Schürzen) that protected against Soviet anti-tank rifles, with six plates installed on each side of the hull and additional plates encasing the turret, leaving only the front open for the main gun.<br><br>The Panzer IV H was armed with the improved 75mm KwK40 L/48 tank gun, featuring a longer barrel than its predecessor's L/43 variant, providing better armor penetration capabilities. It was also the only Panzer IV variant to receive the Zimmerit anti-magnetic paste modification, which was applied to flat surfaces to prevent magnetic mines from sticking to the tank. The vehicle weighed 26.4 tons and was powered by a 300 horsepower engine, giving it a top speed of 39 km/h. With a crew of five and armor thickness of 80mm on the front hull and 50mm on the turret, the Panzer IV H became the backbone of German Panzer divisions from 1943 until the end of World War II, serving on all fronts and earning respect for its balance of firepower, protection, and reliability.",
    "image_1": "img/Pz IV H.png",
    "image_2": "img/Pz IV H 2.jpeg",
    "image_3": "img/Pz IV 3.png",
    "glb": "3d/Pz IV H.glb",
    "flag": "img/de.svg"
  }
]
