[
  {
    "id": "home",
    "name": "Home",
    "country": "",
    "class": "",
    "size": "",
    "description": "This is a site that displays some of my favorite tanks from wwII. it is not meant to be comprehensive or exhaustive, but rather a curated selection of tanks that have left a lasting impact on military history. this is for information and entertainment purposes only. ",
    "image_1": "src/img/home.gif",
    "image_2": "src/img/home.gif",
    "image_3": "src/img/home.gif",
    "gbl": "",
    "flag": "src/img/un.svg"
  },
  {
    "id": "StuG_III_G",
    "name": "StuG III G",
    "country": "Germany",
    "class": "Assault Gun",
    "size": "Medium",
    "description": "The StuG III G was the most widely produced variant of the Sturmgeschütz III, a German assault gun used during World War II. It was designed primarily for infantry support and armed with a 75mm StuK 40 L/48 gun. The G variant featured improved armor and the iconic cylindrical gun mantlet, which provided better protection against enemy fire. The StuG III G served effectively in a variety of roles, including anti-tank duties, and became one of the most feared and reliable German vehicles on the battlefield. Its compact design and powerful gun made it an ideal platform for infantry support and tank destroyer operations.",
    "image_1": "src/img/StuG_III_G.jpg",
    "image_2": "src/img/Stug_III_G_2.jpg",
    "image_3": "src/img/Stug_III_G_3.jpg",
    "gbl": "src/3d/StuG_III_G.gbl",
    "flag": "src/img/de.svg"
  },
  {
    "id": "Tiger_I",
    "name": "Tiger I",
    "country": "Germany",
    "class": "Heavy Tank",
    "size": "Large",
    "description": "The Tiger I was a heavy German tank introduced in 1942 that became one of the most iconic tanks of World War II. Equipped with a formidable 88mm KwK 36 gun, it had exceptional firepower, capable of destroying most Allied tanks from long distances. Its thick, sloped armor made it highly resistant to enemy fire, but this came at the cost of speed and mobility. Despite its mechanical issues and the challenges of its heavy weight, the Tiger I was feared by Allied forces. It served on many fronts and became a symbol of German tank prowess during the war.",
    "image_1": "src/img/Tiger_I.jpg",
    "image_2": "src/img/Tiger_I_2.gif",
    "image_3": "src/img/Tiger_I_3.jpg",
    "gbl": "src/3d/Tiger_I.gbl",
    "flag": "src/img/de.svg"
  },
  {
    "id": "Sd_Kfz_234_2_Puma",
    "name": "Sd. Kfz. 234/2",
    "country": "Germany",
    "class": "Armored Car",
    "size": "Medium",
    "description": "The Sd. Kfz. 234/2 Puma was a German armored reconnaissance vehicle, designed to provide mobility and firepower to reconnaissance units. Armed with a powerful 50mm KwK 39 L/60 gun, the Puma was highly effective in engaging light vehicles and infantry. Its 8-wheeled design gave it excellent mobility, allowing it to operate in diverse terrains. The Puma was used on the Eastern and Western Fronts, where it served as a fast, armored vehicle capable of providing intelligence and engaging in combat. Its speed and agility made it a valuable asset for German forces during the war.",
    "image_1": "src/img/Sd_Kfz_234_2_Puma.jpg",
    "image_2": "src/img/Sd_Kfz_234_2_Puma_2.jpg",
    "image_3": "src/img/Sd_Kfz_234_2_Puma_3.jpg",
    "gbl": "src/3d/puma.gbl",
    "flag": "src/img/de.svg"
  },
  {
    "id": "M22",
    "name": "M22",
    "country": "United States",
    "class": "Light Tank",
    "size": "Small",
    "description": "The M22 Locust was a light American airborne tank used during World War II. It was designed to be airlifted by transport aircraft and dropped directly into combat zones, providing support for airborne infantry. The M22 was armed with a 37mm M6 gun, making it effective against infantry and light vehicles but relatively underpowered against heavier tanks. Its small size and lightweight construction allowed it to be easily transported and deployed, but it lacked the firepower and armor to be considered a true main battle tank. The M22 was primarily used in the Pacific theater, where its mobility was more valuable than its combat capabilities.",
    "image_1": "src/img/M22.gif",
    "image_2": "src/img/M22_2.jpg",
    "image_3": "src/img/M22_3.jpg",
    "gbl": "src/3d/M22.gbl",
    "flag": "src/img/us.jpg"
  },
  {
    "id": "M4A2",
    "name": "M4A2",
    "country": "United States",
    "class": "Medium Tank",
    "size": "Medium",
    "description": "The M4A2 Sherman was an American medium tank variant that played a pivotal role in World War II. Powered by a diesel engine, the M4A2 was less prone to catching fire compared to other Sherman variants, which made it particularly useful for operations in the Pacific theater. Armed with a 75mm M3 gun, it was a versatile tank capable of engaging a variety of targets. The M4A2 saw extensive combat in both the European and Pacific theaters, where it was used by American and Allied forces. Its reliability, ease of production, and adaptability made it one of the most successful tanks of the war.",
    "image_1": "src/img/M4A2.jpg",
    "image_2": "src/img/M4A2_2.jpg",
    "image_3": "src/img/M4A2_3.jpg",
    "gbl": "src/3d/M4A2.gbl",
    "flag": "src/img/us.jpg"
  },
  {
    "id": "M3",
    "name": "M3",
    "country": "United States",
    "class": "Light Tank",
    "size": "Small",
    "description": "The M3 Lee was an American medium tank used in the early years of World War II. It was distinctive for its unique, high-mounted 75mm gun in a side-sponson position, complemented by a 37mm M5 gun in a turret. The M3 was a stopgap solution, as it was developed before the M4 Sherman tank became available. Despite its unconventional design and mechanical issues, the M3 Lee served effectively in North Africa and the Pacific theater. Its combination of firepower and mobility made it an important tank in the early stages of the war, though it was soon outclassed by newer tank designs.",
    "image_1": "src/img/M3.jpg",
    "image_2": "src/img/M3_2.jpg",
    "image_3": "src/img/M3_3.jpg",
    "gbl": "src/3d/M3.gbl",
    "flag": "src/img/us.jpg"
  },
  {
    "id": "KV-2",
    "name": "KV-2",
    "country": "Soviet Union",
    "class": "Heavy Tank",
    "size": "Large",
    "description": "The KV-2 was a Soviet heavy tank introduced in 1940, renowned for its immense firepower. Armed with a massive 152mm howitzer, the KV-2 was designed to engage fortified positions and enemy armor. Its thick armor made it nearly invulnerable to German anti-tank guns early in the war, but the tank's weight and slow speed made it difficult to maneuver. The KV-2 was often used in a siege support role, where its heavy shell fire could destroy bunkers and enemy fortifications. However, its mechanical issues and lack of mobility led to its limited use, and it was eventually replaced by more reliable designs like the T-34.",
    "image_1": "src/img/KV-2.jpg",
    "image_2": "src/img/KV-2_2.jpg",
    "image_3": "src/img/KV-2_3.jpg",
    "gbl": "src/3d/KV-2.gbl",
    "flag": "src/img/su.svg"
  },
  {
    "id": "T-34",
    "name": "T-34 (42)",
    "country": "Soviet Union",
    "class": "Medium Tank",
    "size": "Medium",
    "description": "The T-34/42 was a proposed upgrade to the iconic Soviet T-34 tank, intended to address the evolving needs of the Soviet army in the later years of World War II. It featured improved armor, a more powerful 85mm gun, and enhanced mobility, making it more capable in direct combat. The T-34/42 was designed with a turret that was better suited to the changing battlefield, with a more modern layout to improve crew efficiency. However, the tank was never mass-produced, as the war was winding down, and the Soviet Union turned its focus toward other tank designs like the T-44 and T-55.",
    "image_1": "src/img/T-34_42.gif",
    "image_2": "src/img/T-34_42_2.jpg",
    "image_3": "src/img/T-34_42_3.jpg",
    "gbl": "src/3d/T-34_42.gbl",
    "flag": "src/img/su.svg"
  },
  {
    "id": "SU-122",
    "name": "Su-122",
    "country": "Soviet Union",
    "class": "Self-Propelled Gun",
    "size": "Medium",
    "description": "The SU-122 was a Soviet self-propelled gun developed during World War II, based on the chassis of the T-34 tank. Armed with a 122mm howitzer, the SU-122 was designed to provide artillery support in direct combat situations. It was effective against enemy infantry, fortifications, and light armor, making it versatile on the battlefield. The vehicle’s relatively low profile and good mobility allowed it to operate in various environments, from urban combat to open terrain. While the SU-122 was not as heavily armored as other Soviet tanks, it played an important role in supporting infantry and tank units during key battles.",
    "image_1": "src/img/Su-122.jpg",
    "image_2": "src/img/Su-122_2.jpg",
    "image_3": "src/img/Su-122_3.jpg",
    "gbl": "src/3d/Su-122.gbl",
    "flag": "src/img/su.svg"
  }
]
